功效集合 = list()
發散表寒 = {"川烏": 0, "藁本": 0, "蔥": 0, "川芎": 0, "桂枝": 0, "麻黃": 0, "獨活": 0, "防風": 0,
        "紫蘇": 0, "香薷": 0, "蘇梗": 0, "蒼耳子": 0, "生薑": 0, "辛夷": 0, "建神麯": 0, "胡荽": 0, "浮萍": 0}
# 發散表寒:0
祛風寒 = {"生薑": 0, "附子": 0, "蒼耳草": 0, "細辛": 0, "桂枝": 0, "川芎": 0}
解表發汗 = {"桂枝": 0, "生薑": 0, "藿香": 0}
平喘 = {"蛤蚧": 0, "麻黃": 0, "地龍": 0, "代赭石": 0, "白果": 0, "補骨脂": 0, "蘇子": 0, "松果": 0,
      "杏仁": 0, "桑白皮": 0, "厚朴": 0, "胡桃仁": 0, "紫石英": 0, "砒石": 0, "磁石": 0, "靈芝": 0}
調和藥性 = {"甘草": 0, "大棗": 0}
補脾氣 = {"人參": 0, "白朮": 0, "益智仁": 0, "蒼朮": 0, "龍眼肉": 0, "太子參": 0, "穀芽": 0, "茯苓": 0, "黃耆": 0, "扁豆": 0, "飴糖": 0, "胡荽": 0, "糯米": 0,
       "炙甘草": 0, "黃精": 0, "八角": 0, "扁豆衣": 0, "黨參": 0, "梗米": 0, "扁豆花": 0, "雞內金": 0, "山藥": 0, "蜂蜜": 0, "大棗": 0, "甘草": 0, "砂仁殼": 0}
利皮毛濕 = {"浮萍": 0, "麻黃": 0}
補肝血 = {"紫河車": 0, "熟地黃": 0, "白芍": 0, "枸杞子": 0, "製首烏": 0, "鹿茸": 0, "麋茸": 0, "雞血藤膏": 0, "龜板膠": 0, "茺蔚子": 0, "桑寄生": 0, "酸棗仁": 0,
       "當歸": 0, "肉蓯蓉": 0, "雞血藤": 0, "桑椹": 0, "景天三七": 0, "靈芝": 0, "阿膠": 0, "菟絲子": 0, "女貞子": 0, "穭豆衣": 0, "皂礬": 0, "黨參": 0}
補胃氣 = {"大棗": 0, "飴糖": 0, "梗米": 0}
袪膀胱經風寒 = {"蓽澄茄": 0, "羌活": 0}
發散裡寒 = {"細辛": 0, "附子": 0}
發散表風 = {"荊芥": 0, "蔓荊子": 0, "白芷": 0, "赤檉柳": 0, "蟬衣": 0}
清三焦熱涼血 = {"黃芩": 0}
補心陰涼血 = {"生地黃": 0, "梔子": 0, "丹參": 0, "羊蹄根": 0}
祛風濕 = {"獨活": 0, "藁本": 0, "萆薢": 0, "蒼朮": 0, "青風藤": 0, "白花蛇": 0, "蛇蛻": 0, "雷公藤": 0, "烏梢蛇": 0, "狗脊": 0, "老鸛草": 0, "海桐皮": 0, "千年健": 0, "伸筋草": 0, "五加皮": 0, "海風藤": 0, "松節": 0,
       "尋骨風": 0, "穿山龍": 0, "桑枝": 0, "威靈仙": 0, "防風": 0, "秦艽": 0, "桑寄生": 0, "徐長卿": 0, "防己": 0, "昆明山海棠": 0, "夏天無": 0, "豨薟草": 0, "松葉": 0, "巴戟天": 0, "松果": 0, "臭梧桐": 0, "淫羊藿": 0, "赤檉柳": 0}
活血 = {"當歸": 0, "紅花": 0, "川牛膝": 0, "莪术": 0,
      "桃仁": 0, "川芎": 0, "琥珀": 0, "三七": 0, "續隨子": 0}
補元氣 = {"人參": 0}
補肺氣 = {"蛤蚧":0,"黃耆":0,"西洋參":0,"紫河車":0,"人參":0,"太子參":0,"黨參":0,"靈芝":0,"飴糖":0,"山藥":0}
補心氣 = {"浮小麥":0,"靈芝":0,"龍眼肉":0,"炙甘草":0,"西洋參":0,"小麥":0,"柏子仁":0,"雞蛋":0,"人參":0}
補中氣 = {"黃耆":0}
補衛氣 = {"黃耆":0,"麻黃根":0,"五味子":0,"白朮":0}
固表止汗 = {"黃耆":0,"白朮":0}
托瘡生肌 = {"赤石脂":0,"黃耆":0}
消浮腫 = {"黃耆":0}
燥脾濕 = {"白朮":0,"蒼朮":0,"白豆蔻":0,"草果":0,"天南星":0,"荷葉":0,"扁豆衣":0,"松節":0,"砂仁殼":0,"白豆蔻殼":0,"芡實":0,"秦艽":0,"白鮮皮":0,"松葉":0,"白礬":0,"扁豆花":0,"陳皮":0,"大風子":0,"建神麯":0,"半夏":0,"土槿皮":0,"松香":0,"石灰":0,"樟腦":0,"橘紅":0,"石菖蒲":0,"化橘紅":0,"木瓜":0,"佩蘭":0,"藿香":0,"砂仁":0}
安胎 = {"艾葉":0,"黃芩":0,"苧麻根":0,"菟絲子":0,"砂仁殼":0,"白朮":0,"桑寄生":0,"砂仁":0,"續斷":0,"杜仲":0}
利脾濕 = {"生薑皮":0,"香薷":0,"茯苓":0,"火硝":0,"木槿皮":0,"茯苓皮":0,"大腹皮":0,"澤蘭":0,"旋覆花":0,"扁豆":0,"馬鞭草":0,"落得打":0,"郁李仁":0,"茵陳":0,"薏仁":0,"薏苡仁":0,"大豆黃卷":0,"薏苡根":0}


行脾氣 = {"肉豆蔻":0,"砂仁殼":0,"白豆蔻殼":0,"木香":0,"紅豆蔻":0,"厚朴":0,"佛手":0,"綠萼梅":0,"蘇梗":0,"白豆蔻":0,"紫蘇":0,"化橘紅":0,"陳皮":0,"八角":0,"砂仁":0,"橘紅":0,"佛手花":0,"厚朴花":0,"橘絡":0,"降真香":0,"玫瑰花":0,"建神麯":0,"三稜":0,"九香蟲":0,"娑羅子":0,"葛花":0,"乳香":0,"甘松":0}
化痰 = {"遠志":0,"貝母":0,"礞石":0,"化痰":0,"牛黃":0,"白芥子":0,"橘紅":0,"瓜蔞仁":0,"豬膽汁":0,"蘇子":0,"紫苑":0,"皂莢":0,"佛手":0,"膽南星":0,"白附子":0,"款冬花":0,"海蛤殼":0,"天南星":0,"浮海石":0,"絲瓜絡":0,"兒茶":0,"橘絡":0,"枳實":0,"前胡":0,"化橘紅":0,"金沸草":0,"枳殼":0,"半夏":0,"竹瀝":0,"旋覆花":0,"甘草":0,"松果":0,"冬瓜子":0,"白前":0,"瓦楞子":0,"細辛":0,"硼砂":0,"白毛夏枯草":0,"澤漆":0,"白礬":0,"狼毒":0,"絲瓜絡":0,"雄黃":0,"荸薺":0,"殭蠶":0,"枇杷葉":0,"穿山龍":0,"黃藥子":0,"萊菔子":0,"冬蟲夏草":0,"南沙參":0,"砒石":0,"蛇含":0,"甘蔗":0,"明黨參":0,"天竹黃":0,"蔊菜":0,"虎杖":0,"車前子":0,"陳皮":0,"車前草":0,"掛金燈":0,"橄欖":0,"桔梗":0,"燈籠草":0,"乾薑":0}
補脾陰 = {"山藥":0,"黃精":0,"梗米":0,"萎蕤":0,"扁豆":0,"黑芝麻":0,"甘蔗":0,"蓮子":0}


功效集合.append(發散表寒)
功效集合.append(祛風寒)
