功效集合 = list()
發散表寒 = {"川烏": 0, "藁本": 0, "蔥": 0, "川芎": 0, "桂枝": 0, "麻黃": 0, "獨活": 0, "防風": 0,
        "紫蘇": 0, "香薷": 0, "蘇梗": 0, "蒼耳子": 0, "生薑": 0, "辛夷": 0, "建神麯": 0, "胡荽": 0, "浮萍": 0}
# 發散表寒:0
祛風寒 = {"生薑": 0, "附子": 0, "蒼耳草": 0, "細辛": 0, "桂枝": 0, "川芎": 0}
解表發汗 = {"桂枝": 0, "生薑": 0, "藿香": 0}
平喘 = {"蛤蚧": 0, "麻黃": 0, "地龍": 0, "代赭石": 0, "白果": 0, "補骨脂": 0, "蘇子": 0, "松果": 0,
      "杏仁": 0, "桑白皮": 0, "厚朴": 0, "胡桃仁": 0, "紫石英": 0, "砒石": 0, "磁石": 0, "靈芝": 0}
調和藥性 = {"甘草": 0, "大棗": 0}
補脾氣 = {"人參": 0, "白朮": 0, "益智仁": 0, "蒼朮": 0, "龍眼肉": 0, "太子參": 0, "穀芽": 0, "茯苓": 0, "黃耆": 0, "扁豆": 0, "飴糖": 0, "胡荽": 0, "糯米": 0,
       "炙甘草": 0, "黃精": 0, "八角": 0, "扁豆衣": 0, "黨參": 0, "梗米": 0, "扁豆花": 0, "雞內金": 0, "山藥": 0, "蜂蜜": 0, "大棗": 0, "甘草": 0, "砂仁殼": 0}
利皮毛濕 = {"浮萍": 0, "麻黃": 0}
補肝血 = {"紫河車": 0, "熟地黃": 0, "白芍": 0, "枸杞子": 0, "製首烏": 0, "鹿茸": 0, "麋茸": 0, "雞血藤膏": 0, "龜板膠": 0, "茺蔚子": 0, "桑寄生": 0, "酸棗仁": 0,
       "當歸": 0, "肉蓯蓉": 0, "雞血藤": 0, "桑椹": 0, "景天三七": 0, "靈芝": 0, "阿膠": 0, "菟絲子": 0, "女貞子": 0, "穭豆衣": 0, "皂礬": 0, "黨參": 0}
補胃氣 = {"大棗": 0, "飴糖": 0, "梗米": 0}
袪膀胱經風寒 = {"蓽澄茄": 0, "羌活": 0}
發散裡寒 = {"細辛": 0, "附子": 0}
發散表風 = {"荊芥": 0, "蔓荊子": 0, "白芷": 0, "赤檉柳": 0, "蟬衣": 0}
清三焦熱涼血 = {"黃芩": 0}
補心陰涼血 = {"生地黃": 0, "梔子": 0, "丹參": 0, "羊蹄根": 0}
祛風濕 = {"獨活": 0, "藁本": 0, "萆薢": 0, "蒼朮": 0, "青風藤": 0, "白花蛇": 0, "蛇蛻": 0, "雷公藤": 0, "烏梢蛇": 0, "狗脊": 0, "老鸛草": 0, "海桐皮": 0, "千年健": 0, "伸筋草": 0, "五加皮": 0, "海風藤": 0, "松節": 0,
       "尋骨風": 0, "穿山龍": 0, "桑枝": 0, "威靈仙": 0, "防風": 0, "秦艽": 0, "桑寄生": 0, "徐長卿": 0, "防己": 0, "昆明山海棠": 0, "夏天無": 0, "豨薟草": 0, "松葉": 0, "巴戟天": 0, "松果": 0, "臭梧桐": 0, "淫羊藿": 0, "赤檉柳": 0}
活血 = {"當歸": 0, "紅花": 0, "川牛膝": 0, "莪术": 0,
      "桃仁": 0, "川芎": 0, "琥珀": 0, "三七": 0, "續隨子": 0}


功效集合.append(發散表寒)
功效集合.append(祛風寒)
