# 0
補元氣 = {"人參": 0}
# 1
補脾氣 = {"人參": 0, "白朮": 0, "益智仁": 0, "蒼朮": 0, "龍眼肉": 0, "太子參": 0, "穀芽": 0, "茯苓": 0, "黃耆": 0, "扁豆": 0, "飴糖": 0, "胡荽": 0, "糯米": 0,
       "炙甘草": 0, "黃精": 0, "八角": 0, "扁豆衣": 0, "黨參": 0, "梗米": 0, "扁豆花": 0, "雞內金": 0, "山藥": 0, "蜂蜜": 0, "大棗": 0, "甘草": 0, "砂仁殼": 0, "六君子湯": 0}
# 2
補肺氣 = {"蛤蚧": 0, "黃耆": 0, "西洋參": 0, "紫河車": 0, "人參": 0,
       "太子參": 0, "黨參": 0, "靈芝": 0, "飴糖": 0, "山藥": 0}
# 3
補心氣 = {"浮小麥": 0, "靈芝": 0, "龍眼肉": 0, "炙甘草": 0,
       "西洋參": 0, "小麥": 0, "柏子仁": 0, "雞蛋": 0, "人參": 0}
# 4
補中氣 = {"黃耆": 0}
# 5
補衛氣 = {"黃耆": 0, "麻黃根": 0, "五味子": 0, "白朮": 0, "五味子": 0}
# 6
補胃氣 = {"大棗": 0, "飴糖": 0, "梗米": 0, "六君子湯": 0}
# 7
補腎氣 = {"紫河車": 0, "臍帶": 0, "鹿茸": 0, "西洋參": 0}
# 8
補脾陰 = {"山藥": 0, "黃精": 0, "梗米": 0, "萎蕤": 0, "扁豆": 0, "黑芝麻": 0, "甘蔗": 0, "蓮子": 0}
# 9
補脾血 = {"龍眼肉": 0, "大棗": 0, "皂礬": 0, "當歸": 0, "花椒": 0}
# 10
補脾陽 = {"胡椒": 0, "母丁香": 0, "生薑": 0, "丁香": 0, "乾薑": 0, "竈心土": 0, "肉豆蔻": 0, "紅豆蔻": 0, "草果": 0,
       "益智仁": 0, "蓽茇": 0, "砂仁": 0, "蓽澄茄": 0, "葛根": 0, "白豆蔻": 0, "吳茱萸": 0, "高良薑": 0, "補骨脂": 0}
# 11
補腎精 = {"紫河車": 0, "龜版": 0, "覆盆子": 0, "熟地黃": 0, "韭菜子": 0, "麋茸": 0, "蛤蚧": 0, "沙苑子": 0, "胡桃仁": 0, "杜仲": 0, "菟絲子": 0, "製首烏": 0, "川牛膝": 0, "巴戟天": 0, "狗脊": 0,
       "五加皮": 0, "續斷": 0, "鹿茸": 0, "肉蓯蓉": 0, "仙茅": 0, "千年健": 0, "骨碎補": 0, "鹿銜草": 0, "枸杞子": 0, "桑寄生": 0, "補骨脂": 0, "芡實": 0, "淫羊藿": 0, "女貞子": 0, "蓮子": 0, "鹿角膠": 0}
# 12
補肺陰 = {"麥冬": 0, "天門冬": 0, "黑芝麻": 0, "梨皮": 0, "西洋參": 0, "梗米": 0, "黃精": 0, "知母": 0,
       "沙參": 0, "生地黃": 0, "阿膠": 0, "百合": 0, "鹿銜草": 0, "款冬花": 0, "海粉": 0, "玄參": 0, "山藥": 0, "甘草": 0, "雞子黃": 0, "北沙參": 0, "貝母": 0}
# 13
補腎陰 = {"龜板膠": 0, "生地黃": 0, "桑椹": 0, "鱉甲": 0, "石斛": 0, "黑芝麻": 0, "女貞子": 0, "龜版": 0,
       "熟地黃": 0, "旱蓬草": 0, "枸杞子": 0, "玄參": 0, "黃精": 0, "西洋參": 0, "五味子": 0, "海粉": 0, "山藥": 0, "豬脊髓": 0, "知母": 0, "雞子黃": 0, "龜甲": 0}
# 14
補心陰 = {"阿膠": 0, "龜板膠": 0, "西洋參": 0, "桑椹": 0, "生地黃": 0, "蓮子": 0, "麥冬": 0}
# 15
補肝陰 = {"旱蓬草": 0, "鱉甲": 0, "鼈甲膠": 0, "珍珠母": 0, "五加皮": 0, "刺蒺藜": 0, "桑椹": 0, "代赭石": 0, "女貞子": 0,
       "龜板膠": 0, "決明子": 0, "黑芝麻": 0, "穭豆衣": 0, "血餘炭": 0, "千年健": 0, "鹿銜草": 0, "牡蠣": 0, "生地黃": 0, "龍骨": 0}
# 16
補胃陰 = {"石斛": 0, "麥冬": 0, "萎蕤": 0, "糯稻根鬚": 0, "血餘炭": 0, "沙參": 0, "北沙參": 0}
# 17
補腎陽 = {"鹿角": 0, "麋茸": 0, "紫石英": 0, "鹿角膠": 0, "龜版": 0, "鹿茸": 0, "黃狗腎": 0, "硫磺": 0, "鹿角霜": 0, "蛇床子": 0, "胡桃仁": 0, "蛤蚧": 0, "狗脊": 0, "麋角": 0,
       "九香蟲": 0, "仙茅": 0, "淫羊藿": 0, "肉桂": 0, "冬蟲夏草": 0, "附子": 0, "續斷": 0, "杜仲": 0, "桑螵蛸": 0, "巴戟天": 0, "鎖陽": 0, "山茱萸": 0, "川牛膝": 0, "補骨脂": 0, "肉蓯蓉": 0}
# 18
補肺陽 = {"生薑": 0, "紫石英": 0, "胡桃仁": 0, "細辛": 0, "乾薑": 0}
# 19
補肝陽 = {"韭菜子": 0, "冬蟲夏草": 0, "山茱萸": 0, "狗脊": 0,
       "鹿角膠": 0, "續斷": 0, "川牛膝": 0, "杜仲": 0}
# 20
補心血 = {"龍眼肉": 0, "當歸": 0, "桑椹": 0,  "柏子仁": 0, "酸棗仁": 0,
       "蓮子": 0, "景天三七": 0, "龜板膠": 0, "鼈甲膠": 0, "靈芝": 0, "龜版": 0}
# 21
補肝血 = {"紫河車": 0, "熟地黃": 0, "白芍": 0, "枸杞子": 0, "製首烏": 0, "鹿茸": 0, "麋茸": 0, "雞血藤膏": 0, "龜板膠": 0, "茺蔚子": 0, "桑寄生": 0, "酸棗仁": 0,
       "當歸": 0, "肉蓯蓉": 0, "雞血藤": 0, "桑椹": 0, "景天三七": 0, "靈芝": 0, "阿膠": 0, "菟絲子": 0, "女貞子": 0, "穭豆衣": 0, "皂礬": 0, "黨參": 0}
# 22
補肺血 = {"阿膠": 0, "紫河車": 0, "靈芝": 0}
# 23
補腎血 = {"龜板膠": 0, "阿膠": 0, "桑椹": 0, "紫河車": 0}
# 24
補心陰涼血 = {"生地黃": 0, "梔子": 0, "丹參": 0, "羊蹄根": 0}
# 25
補肝陰涼血 = {"丹參": 0, "犀角": 0, "生地黃": 0, "白薇": 0, "地骨皮": 0,
         "梔子": 0, "羊蹄根": 0, "旱蓬草": 0, "赤芍": 0, "桑葉": 0}
# 26
補腎陰涼血 = {"玄參": 0, "生地黃": 0, "旱蓬草": 0, "犀角": 0, "地骨皮": 0}
# 27
補胃陰涼血 = {"犀角": 0, "梔子": 0, "白茅根": 0, "白薇": 0}
# 28
補三焦陰涼血 = {"梔子": 0}
# 29
補經絡陽 = {"乾薑": 0, "桂枝": 0}
# 30
平肝陽 = {"牛黃": 0, "熊膽": 0, "羚羊角": 0, "蚤休": 0, "白芍": 0, "石決明": 0, "龍骨": 0, "生赭石": 0}
# 31
平肝熱 = {"菊花": 0, "山羊角": 0, "羅布麻": 0, "穭豆衣": 0, "礞石": 0, "玳瑁": 0, "生鐵落": 0}
# 32
平喘 = {"蛤蚧": 0, "麻黃": 0, "地龍": 0, "代赭石": 0, "白果": 0, "補骨脂": 0, "蘇子": 0, "松果": 0,
      "杏仁": 0, "桑白皮": 0, "厚朴": 0, "胡桃仁": 0, "紫石英": 0, "砒石": 0, "磁石": 0, "靈芝": 0}
# 33
排膿 = {"升藥": 0, "桔梗": 0, "薏苡仁": 0}
# 34
排肺膿 = {"魚腥草": 0, "金蕎麥": 0, "桔梗": 0}
# 35
排皮膚膿 = {"冬瓜子": 0, "桔梗": 0}
# 36
明目 = {"枸杞子": 0, "木賊": 0, "菊花": 0, "爐甘石": 0, "菟絲子": 0}
# 37
發散表寒 = {"川烏": 0, "藁本": 0, "蔥": 0, "川芎": 0, "桂枝": 0, "麻黃": 0, "獨活": 0, "防風": 0,
        "紫蘇": 0, "香薷": 0, "蘇梗": 0, "蒼耳子": 0, "生薑": 0, "辛夷": 0, "建神麯": 0, "胡荽": 0, "浮萍": 0, "桂心": 0, "薑炭": 0}
# 38
發散表熱 = {"連翹": 0, "蔓荊子": 0, "升麻": 0, "淡豆豉": 0, "木賊": 0, "蟬衣": 0}
# 39
發散裡寒 = {"細辛": 0, "附子": 0}
# 40
發散表風 = {"荊芥": 0, "蔓荊子": 0, "白芷": 0, "赤檉柳": 0, "蟬衣": 0}
# 41
發汗解表 = {"麻黃": 0}
# 42
透疹 = {"升麻": 0, "麻黃": 0, "葛根": 0, "赤檉柳": 0, "紫草": 0,
      "荊芥": 0, "牛蒡子": 0, "浮萍": 0, "薄荷": 0, "蟬衣": 0, "胡荽": 0}
# 43
透發麻疹 = {"葛根": 0}
# 44
通乳 = {"通草": 0, "穿山甲": 0, "木通": 0, "皂刺": 0, "梗通草": 0}
# 45
通腎竅 = {"細辛": 0}
# 46
通鼻竅 = {"麻黃": 0, "辛夷": 0, "蒼耳子": 0, "白芷": 0}
# 47
通膀胱竅 = {"細辛": 0}
# 48
通利咽喉 = {"板藍根": 0, "胖大海": 0, "橄欖": 0, "藏青果": 0,
        "馬勃": 0, "金果欖": 0, "訶子": 0, "桔梗": 0, "掛金燈": 0, "玄參": 0}
# 49
通經絡 = {"忍冬藤": 0, "烏梢蛇": 0, "蠍": 0, "馬錢子": 0, "橘絡": 0, "穿山龍": 0, "天麻": 0, "絲瓜絡": 0,
       "地龍": 0, "尋骨風": 0, "白花蛇": 0, "海桐皮": 0, "桑枝": 0, "海風藤": 0, "威靈仙": 0,  "豨薟草": 0, "酒": 0, "麝香": 0, "通草": 0}
# 50
托瘡生肌 = {"赤石脂": 0, "黃耆": 0}
# 51
托瘡毒 = {"鹿茸": 0}
# 52
調和藥性 = {"甘草": 0, "大棗": 0, "炙甘草": 0, "蜂蜜": 0, "冰糖": 0}
# 53
調衝任 = {"鹿茸": 0}
# 54
拖瘡生肌 = {"黃耆": 0}
# 55
納腎氣 = {"臍帶": 0, "磁石": 0, "補骨脂": 0}
# 56
利脾濕 = {"生薑皮": 0, "香薷": 0, "茯苓": 0, "火硝": 0, "木槿皮": 0, "茯苓皮": 0, "大腹皮": 0, "澤蘭": 0, "旋覆花": 0,
       "扁豆": 0, "馬鞭草": 0, "落得打": 0, "郁李仁": 0, "茵陳": 0, "薏仁": 0, "薏苡仁": 0, "大豆黃卷": 0, "薏苡根": 0}
# 57
利肝濕 = {"茵陳": 0, "金錢草": 0, "澤蘭": 0, "虎杖": 0, "木槿皮": 0, "車前草": 0, "梔子": 0, "青葉膽": 0, "地耳草": 0, "垂盆草": 0, "通草": 0,
       "鬼針草": 0, "輕粉": 0, "萆薢": 0, "梗通草": 0, "馬鞭草": 0, "玉米鬚": 0, "拳參": 0, "草決明": 0, "落得打": 0, "雞骨草": 0, "蔊菜": 0, "白英": 0}
# 58
利肺濕 = {"浮萍": 0, "澤漆": 0, "麻黃": 0, "生薑皮": 0, "冬瓜皮": 0, "旋覆花": 0,
       "葫蘆": 0, "半邊蓮": 0, "通草": 0, "冬瓜子": 0, "虎杖": 0, "蔊菜": 0, "桑白皮": 0}
# 59
利腎濕 = {"澤瀉": 0, "防己": 0, "金錢草": 0, "車前草": 0,
       "地膚子": 0, "玉米鬚": 0, "輕粉": 0, "茯苓皮": 0, "落得打": 0}
# 60
利三焦濕 = {"麻黃": 0, "浮萍": 0, "梔子": 0}
# 61
利膀胱濕 = {"澤瀉": 0, "通草": 0, "梗通草": 0, "木通": 0, "滑石": 0, "車前草": 0, "防己": 0, "萆薢": 0, "金錢草": 0,
        "地膚子": 0, "玉米鬚": 0, "螻蛄": 0, "蟋蟀": 0, "海金沙": 0, "薏苡根": 0, "鳳尾草": 0, "檳榔": 0, "車前子": 0}
# 62
利皮毛濕 = {"浮萍": 0, "麻黃": 0}
# 63
利胃濕 = {"薏苡仁": 0, "滑石": 0, "旋覆花": 0, "扁豆": 0, "萆薢": 0}
# 64
利大腸濕 = {"旋覆花": 0, "冬瓜子": 0, "鬼針草": 0, "澤漆": 0, "木槿皮": 0, "拳參": 0, "鳳尾草": 0}
# 65
利心濕 = {"木通": 0, "淡竹葉": 0}
# 66
利小腸濕 = {"澤漆": 0, "木通": 0, "垂盆草": 0, "葫蘆": 0,
        "白花蛇舌草": 0, "半邊蓮": 0, "冬瓜皮": 0, "淡竹葉": 0}
# 67
利尿通淋 = {"川牛膝": 0, "木通": 0, "琥珀": 0, "苧麻根": 0, "白茅根": 0, "竹瀝": 0, "淡竹葉": 0, "羅布麻": 0, "萹蓄": 0, "海金沙": 0, "土牛膝": 0, "萆薢": 0, "金錢草": 0, "西瓜": 0, "半枝蓮": 0, "龍葵": 0,
        "白薇": 0, "馬齒莧": 0, "西瓜翠衣": 0, "白花蛇舌草": 0, "血餘炭": 0, "滑石": 0, "苦參": 0, "冬葵子": 0, "地龍": 0, "鴨跖草": 0, "掛金燈": 0, "魚腥草": 0, "葎草": 0, "萬年青": 0, "玉米鬚": 0, "小麥": 0}
# 68
療傷續折 = {"續斷": 0}
# 69
療瘡 = {"紫草": 0, "紫珠": 0}
# 70
斂肺氣 = {"罌粟殼": 0, "五味子": 0, "訶子": 0, "白果": 0}
# 71
斂腎精 = {"補骨脂": 0, "金櫻子": 0, "雞內金": 0}
# 72
固表止汗 = {"黃耆": 0, "白朮": 0}
# 73
固精 = {"韭菜子": 0, "菟絲子": 0, "五倍子": 0, "刺蝟皮": 0, "益智仁": 0,
      "烏賊骨": 0, "桑螵蛸": 0, "覆盆子": 0, "金櫻子": 0, "補骨脂": 0, "蓮鬚": 0}
# 74
開提肺氣 = {"桔梗": 0}
# 75
開心竅 = {"蘇合香": 0, "石菖蒲": 0, "遠志": 0, "牛黃": 0,
       "樟腦": 0, "鬱金": 0, "竹瀝": 0, "五味子": 0}
# 76
寬中 = {"厚朴花": 0}
# 77
活血 = {"當歸": 0, "紅花": 0, "川牛膝": 0, "莪术": 0,
      "桃仁": 0, "川芎": 0, "琥珀": 0, "三七": 0, "續隨子": 0, "酒": 0, "益母草": 0, "丹參": 0, "懷牛膝": 0}
# 78
活心血 = {"番紅花": 0, "降真香": 0, "蘇木": 0, "鬱金": 0, "血竭": 0, "沒藥": 0,
       "紫草": 0, "劉寄奴": 0, "牡丹皮": 0, "乳香": 0, "合歡皮": 0, "卷柏": 0}
# 79
活肝血 = {"雞血藤膏": 0, "丹參": 0, "血竭": 0, "茜草": 0, "茺蔚子": 0, "雞血藤": 0, "卷柏": 0, "土牛膝": 0, "鬼箭羽": 0, "蘇木": 0, "馬鞭草": 0, "澤蘭": 0, "虎杖": 0, "落得打": 0, "石見穿": 0, "沒藥": 0, "穿山龍": 0,
       "穿山甲": 0, "玄胡": 0, "鬱金": 0, "降真香": 0, "夏天無": 0, "番紅花": 0, "王不留行": 0, "合歡皮": 0, "地耳草": 0, "昆明山海棠": 0, "鬼針草": 0, "乳香": 0, "紫草": 0, "月季花": 0, "毛冬青": 0, "皂刺": 0, "牡丹皮": 0, "山楂": 0}
# 80
活脾血 = {"玄胡": 0, "蘇木": 0, "降真香": 0, "澤蘭": 0, "牡丹皮": 0, "大黃": 0,
       "乳香": 0, "劉寄奴": 0, "石見穿": 0, "落得打": 0, "馬鞭草": 0, "沒藥": 0, "山楂": 0}
# 81
活肺血 = {"穿山龍": 0, "玄胡": 0, "虎杖": 0, "毛冬青": 0, "龍葵": 0}
# 82
活腎血 = {"土牛膝": 0, "落得打": 0, "牡丹皮": 0}
活胃血 = {"王不留行": 0, "穿山甲": 0, "大黃": 0, "皂刺": 0, "山楂": 0}
活大腸血 = {"大黃": 0, "鬼針草": 0, "紅藤": 0, "毛冬青": 0}
活心包血 = {"玄胡": 0}
活血通淋 = {"川牛膝": 0}
化痰 = {"遠志": 0, "貝母": 0, "礞石": 0, "化痰": 0, "牛黃": 0, "白芥子": 0, "橘紅": 0, "瓜蔞仁": 0, "豬膽汁": 0, "蘇子": 0, "紫苑": 0, "皂莢": 0, "佛手": 0, "膽南星": 0, "白附子": 0, "款冬花": 0, "海蛤殼": 0, "天南星": 0, "浮海石": 0, "絲瓜絡": 0, "兒茶": 0, "橘絡": 0, "枳實": 0, "前胡": 0, "化橘紅": 0, "金沸草": 0, "枳殼": 0, "半夏": 0, "竹瀝": 0, "旋覆花": 0, "甘草": 0, "松果": 0, "冬瓜子": 0,
      "白前": 0, "瓦楞子": 0, "細辛": 0, "硼砂": 0, "白毛夏枯草": 0, "澤漆": 0, "白礬": 0, "狼毒": 0,  "雄黃": 0, "荸薺": 0, "殭蠶": 0, "枇杷葉": 0, "穿山龍": 0, "黃藥子": 0, "萊菔子": 0, "冬蟲夏草": 0,"砒石": 0, "蛇含": 0, "甘蔗": 0, "明黨參": 0, "天竹黃": 0, "蔊菜": 0, "虎杖": 0, "車前子": 0, "陳皮": 0, "車前草": 0, "掛金燈": 0, "橄欖": 0, "桔梗": 0, "燈籠草": 0, "乾薑": 0, "紫菀": 0, "竹茹": 0, "六君子湯": 0}
回陽 = {"附子": 0, "乾薑": 0}
緩急 = {"白芍": 0, "飴糖": 0}
解表發汗 = {"桂枝": 0, "生薑": 0, "藿香": 0}
降肺氣 = {"白前": 0, "前胡": 0, "旋覆花": 0, "杏仁": 0, "蘇子": 0, "枇杷葉": 0, "萊菔子": 0}
降胃氣 = {"丁香": 0, "母丁香": 0, "代赭石": 0, "半夏": 0, "旋覆花": 0, "柿蒂": 0,
       "刀豆": 0, "大腹皮": 0, "炙甘草": 0, "陳皮": 0, "藿香": 0, "扁豆花": 0, "枇杷葉": 0, "大麥芽": 0}
解毒 = {"生薑": 0, "甘草": 0, "乾薑": 0}
解心毒 = {"硃砂": 0, "水牛角": 0, "牛黃": 0, "熊膽": 0, "金銀花": 0, "連翹": 0, "火硝": 0, "板藍根": 0, "毛茛": 0, "雄黃": 0, "梔子": 0, "蒼耳子": 0, "玳瑁": 0,
       "馬尾連": 0, "紫草": 0, "大青葉": 0, "紫花地丁": 0, "忍冬藤": 0, "鉛丹": 0, "蟾酥": 0, "四季青": 0, "半邊蓮": 0, "蟾皮": 0, "墓頭回": 0, "綠豆": 0, "綠豆衣": 0, "掛金燈": 0}
解肝毒 = {"白英": 0, "野菊花": 0, "熊膽": 0, "羚羊角": 0, "青黛": 0, "蠍": 0, "牛黃": 0, "生首烏": 0, "紫草": 0, "膽礬": 0, "守宮": 0, "斑蝥": 0, "木鼈子": 0, "虎杖": 0, "白礬": 0, "三顆針": 0, "苧麻根": 0, "露蜂房": 0, "腫節風": 0, "貫眾": 0, "千里光": 0, "大風子": 0, "山慈姑": 0, "地榆": 0, "半枝蓮": 0, "虎杖": 0, "毛茛": 0, "蚤休": 0, "密陀僧": 0, "菊花": 0, "地錦草": 0, "地耳草": 0, "鴉膽子": 0, "紫背天葵": 0, "皂礬": 0, "天葵子": 0,
       "水牛角": 0, "菊葉三七": 0, "虎耳草": 0, "秦皮": 0, "木芙蓉葉": 0, "鉛丹": 0, "土牛膝": 0, "輕粉": 0, "爐甘石": 0, "石灰": 0, "鐵莧菜": 0, "絲瓜絡": 0, "黃藥子": 0, "徐長卿": 0, "落得打": 0, "白薇": 0, "木槿皮": 0, "馬鞭草": 0, "垂盆草": 0, "雞骨草": 0, "豨薟草": 0, "蛇含": 0, "蛇莓": 0, "檵木": 0, "青葉膽": 0, "玳瑁": 0, "六月雪": 0, "土茯苓": 0, "紫珠": 0, "紫花地丁": 0, "蔊菜": 0, "鬼針草": 0, "敗醬草": 0, "拳參": 0, "墓頭回": 0, "葎草": 0}
解肺毒 = {"馬勃": 0, "北豆根": 0, "龍葵": 0, "山豆根": 0, "白毛夏枯草": 0, "黃芩": 0, "白礬": 0, "野菊花": 0, "穿心蓮": 0, "半枝蓮": 0, "忍冬藤": 0, "金銀花": 0, "馬齒莧": 0, "硼砂": 0, "大蒜": 0, "半邊蓮": 0, "大青葉": 0, "蒼耳草": 0, "牛蒡子": 0, "馬尾連": 0, "六月雪": 0, "蛇含": 0,
       "白蘞": 0, "木芙蓉葉": 0, "絲瓜絡": 0, "紫珠": 0, "千里光": 0, "鴨跖草": 0, "黃藥子": 0, "藏青果": 0, "橄欖": 0, "雪膽": 0, "鐵莧菜": 0, "蔊菜": 0, "萬年青": 0, "金蕎麥": 0, "金蓮花": 0, "四季青": 0, "金果欖": 0, "葎草": 0, "掛金燈": 0, "蔥": 0, "燈籠草": 0, "蛇莓": 0, "蒟蒻": 0, "魚腥草": 0}
解胃毒 = {"升麻": 0, "犀角": 0, "大黃": 0, "黃柏": 0, "黃連": 0, "天花粉": 0, "玄參": 0, "木鼈子": 0, "白礬": 0, "露蜂房": 0, "板藍根": 0, "大蒜": 0, "白花蛇舌草": 0, "土茯苓": 0, "漏蘆": 0, "敗醬草": 0, "綠豆衣": 0, "硼砂": 0, "白鮮皮": 0,
       "半枝蓮": 0, "毛茛": 0, "大青葉": 0, "甘草": 0, "穿心蓮": 0, "地榆": 0, "爐甘石": 0, "絲瓜絡": 0, "金蓮花": 0, "鴨跖草": 0, "地錦草": 0, "生薑": 0, "三顆針": 0, "雪膽": 0, "徐長卿": 0, "蒟蒻": 0, "蛇莓": 0, "紫珠": 0, "綠豆": 0, "檵木": 0}
解大腸毒 = {"鴉膽子": 0, "穿心蓮": 0, "紅藤": 0, "白頭翁": 0, "敗醬草": 0, "地榆": 0, "白礬": 0, "三顆針": 0, "蒼耳子": 0, "白花蛇舌草": 0, "秦皮": 0, "馬尾連": 0, "斑蝥": 0, "六月雪": 0,
        "馬齒莧": 0, "鐵莧菜": 0, "木槿皮": 0, "地錦草": 0, "腫節風": 0, "鳳尾草": 0, "千里光": 0, "拳參": 0, "檵木": 0, "鬼針草": 0, "葎草": 0, "委陵菜": 0, "翻白草": 0, "虎耳草": 0}
解膽毒 = {"膽礬": 0, "秦皮": 0, "熊膽": 0, "虎杖": 0, "青葉膽": 0,
       "毛茛": 0, "白英": 0, "地耳草": 0, "垂盆草": 0, "雞骨草": 0}
解蛇毒 = {"雷公藤": 0, "金錢草": 0, "續隨子": 0, "白附子": 0, "青木香": 0}
截瘧 = {"青蒿": 0, "生首烏": 0, "常山": 0, "蜀漆": 0, "雄黃": 0,
      "草果": 0, "毛茛": 0, "鉛丹": 0, "馬鞭草": 0, "砒石": 0}
清熱解毒 = {"甘草": 0, "桔梗": 0, "薏苡仁": 0}
祛風寒 = {"生薑": 0, "附子": 0, "蒼耳草": 0, "細辛": 0, "桂枝": 0, "川芎": 0, "防風": 0, "秦艽": 0}
袪膀胱經風寒 = {"蓽澄茄": 0, "羌活": 0}
清三焦熱涼血 = {"黃芩": 0}
祛風濕 = {"獨活": 0, "藁本": 0, "萆薢": 0, "蒼朮": 0, "青風藤": 0, "白花蛇": 0, "蛇蛻": 0, "雷公藤": 0, "烏梢蛇": 0, "狗脊": 0, "老鸛草": 0, "海桐皮": 0, "千年健": 0, "伸筋草": 0, "五加皮": 0, "海風藤": 0, "松節": 0,
       "尋骨風": 0, "穿山龍": 0, "桑枝": 0, "威靈仙": 0, "防風": 0, "秦艽": 0, "桑寄生": 0, "徐長卿": 0, "防己": 0, "昆明山海棠": 0, "夏天無": 0, "豨薟草": 0, "松葉": 0, "巴戟天": 0, "松果": 0, "臭梧桐": 0, "淫羊藿": 0, "赤檉柳": 0}
清心熱涼血 = {"牡丹皮": 0, "鬱金": 0, "紫草": 0, "板藍根": 0,
         "水牛角": 0, "苧麻根": 0, "黃芩": 0, "大青葉": 0, "四季青": 0}
清肝熱涼血 = {"黃芩": 0, "青黛": 0, "茜草": 0, "水牛角": 0, "荷葉": 0, "地榆": 0,
         "白薇": 0, "紫草": 0, "十大功勞": 0, "牡丹皮": 0, "鬱金": 0, "馬齒莧": 0, "地錦草": 0}
清肺熱涼血 = {"青黛": 0, "黃芩": 0, "大青葉": 0, "白毛夏枯草": 0, "虎耳草": 0, "四季青": 0, "萬年青": 0}
清腎熱涼血 = {"牡丹皮": 0}
清胃熱涼血 = {"白薇": 0, "十大功勞": 0, "青黛": 0, "地榆": 0, "水牛角": 0,
         "板藍根": 0, "黃芩": 0, "地錦草": 0, "大青葉": 0, "虎耳草": 0, "荷葉": 0}
清膽熱涼血 = {"鬱金": 0, "黃芩": 0}
清心熱 = {"連翹": 0, "梔子": 0, "黃連": 0, "熊膽": 0, "馬尾連": 0, "牛黃": 0, "西瓜翠衣": 0, "水牛角": 0, "板藍根": 0, "荷葉": 0, "木通": 0, "羅布麻": 0, "淡竹葉": 0, "蟾皮": 0, "天竹黃": 0, "白茅根": 0, "綠豆": 0, "綠豆衣": 0, "金銀花": 0,
       "大青葉": 0, "百合": 0, "紫花地丁": 0, "四季青": 0, "半邊蓮": 0, "寒水石": 0, "苧麻根": 0, "生地黃": 0, "鐵莧菜": 0, "梨皮": 0, "硃砂": 0, "鐵莧菜": 0, "犀角": 0, "玳瑁": 0, "墓頭回": 0, "忍冬藤": 0, "西瓜": 0, "羚羊角": 0, "掛金燈": 0}
清肝熱 = {"生地黃": 0, "犀角": 0, "荷葉": 0, "牛黃": 0, "青黛": 0, "茵陳": 0, "鬼針草": 0, "熊膽": 0, "鴉膽子": 0, "龍膽草": 0, "秦皮": 0, "膽南星": 0, "槐角": 0, "珍珠": 0, "水牛角": 0, "虎杖": 0, "苧麻根": 0, "羅布麻": 0, "金錢草": 0, "敗醬草": 0, "墓頭回": 0, "密蒙花": 0, "白薇": 0, "紫背天葵": 0, "柴胡": 0, "山慈姑": 0, "野菊花": 0, "半枝蓮": 0, "白英": 0, "腫節風": 0, "玳瑁": 0, "穀精草": 0, "梔子": 0, "天葵子": 0, "十大功勞": 0,
       "六月雪": 0, "地錦草": 0, "青葙子": 0, "紫花地丁": 0, "天竹黃": 0, "黃藥子": 0, "毛冬青": 0, "玉米鬚": 0, "貫眾": 0, "土牛膝": 0, "白礬": 0, "木槿皮": 0, "落得打": 0, "鐵莧菜": 0, "鼈甲膠": 0, "椿皮": 0, "千里光": 0, "蚤休": 0, "檵木": 0, "葎草": 0, "地耳草": 0, "蛇莓": 0, "赤芍": 0, "雞骨草": 0, "黃連": 0, "蔊菜": 0, "車前草": 0, "馬鞭草": 0, "蛇含": 0, "虎耳草": 0, "垂盆草": 0, "青葉膽": 0, "豨薟草": 0, "拳參": 0, "三顆針": 0, "竹茹": 0, "鈎藤": 0}
清脾熱 = {"西瓜霜": 0, "天葵子": 0, "虎耳草": 0, "紫背天葵": 0, "大黃": 0, "白礬": 0, "薏苡根": 0,
       "落得打": 0, "馬鞭草": 0, "木槿皮": 0, "薏苡仁": 0, "燈籠草": 0, "白鮮皮": 0, "貫眾": 0}
清肺熱 = {"六月雪": 0, "知母": 0, "穿心蓮": 0, "瓜蔞仁": 0, "大青葉": 0, "蘆根": 0, "北豆根": 0, "金銀花": 0, "連翹": 0, "半邊蓮": 0, "山豆根": 0, "石膏": 0, "馬勃": 0, "兒茶": 0, "前胡": 0, "荸薺": 0, "白礬": 0, "西瓜霜": 0, "海粉": 0, "黃柏": 0, "海蛤殼": 0, "馬尾連": 0, "魚腥草": 0, "硼砂": 0, "蛇含": 0, "黃芩": 0, "金蓮花": 0, "白毛夏枯草": 0, "野菊花": 0, "浮海石": 0, "冬瓜子": 0,
       "生地黃": 0, "龍葵": 0, "忍冬藤": 0, "通草": 0, "胖大海": 0, "豬膽汁": 0, "桑白皮": 0, "黃藥子": 0, "明黨參": 0, "地龍": 0, "絲瓜絡": 0, "半枝蓮": 0, "枇杷葉": 0, "千里光": 0, "雪膽": 0, "鴨跖草": 0, "四季青": 0, "蒼耳草": 0, "藏青果": 0, "訶子": 0, "蛇莓": 0, "薏苡仁": 0, "掛金燈": 0, "毛冬青": 0, "橄欖": 0, "蔊菜": 0, "金蕎麥": 0, "虎杖": 0, "燈籠草": 0, "萬年青": 0, "金果欖": 0, "葎草": 0, "玄參": 0, "葦莖": 0, "麥冬": 95, "貝母": 0}
清腎熱 = {"知母": 0, "黃柏": 0, "玄參": 0, "地膚子": 0, "金錢草": 0, "車前草": 0,
       "黃芩": 0, "寒水石": 0, "生地黃": 0, "土牛膝": 0, "豨薟草": 0, "落得打": 0}
清膽熱 = {"熊膽": 0, "柴胡": 0, "虎杖": 0, "金錢草": 0, "天竹黃": 0,
       "黃芩": 0, "白英": 0, "雞骨草": 0, "地耳草": 0, "青葉膽": 0, "垂盆草": 0}
清大腸熱 = {"白頭翁": 0, "芒硝": 0, "胡黃連": 0, "枳殼": 0, "敗醬草": 0, "鴉膽子": 0, "大黃": 0, "苦參": 0, "白礬": 0, "木槿皮": 0, "冬瓜子": 0, "枳實": 0, "白花蛇舌草": 0, "黃柏": 0, "黃芩": 0, "番瀉葉": 0, "黃連": 0, "紅藤": 0, "穿心蓮": 0,
        "椿皮": 0, "毛冬青": 0, "鐵莧菜": 0, "荸薺": 0, "腫節風": 0, "六月雪": 0, "千里光": 0, "十大功勞": 0, "馬尾連": 0, "鳳尾草": 0, "拳參": 0, "委陵菜": 0, "檵木": 0, "地錦草": 0, "三顆針": 0, "鬼針草": 0, "虎耳草": 0, "翻白草": 0, "葎草": 0}
清膀胱熱 = {"西瓜翠衣": 0, "滑石": 0, "黃柏": 0, "木通": 0, "苦參": 0, "車前草": 0, "金錢草": 0, "龍膽草": 0, "地膚子": 0, "白茅根": 0,
        "薏苡根": 0, "葎草": 0, "龍葵": 0, "西瓜": 0, "地龍": 0, "天葵子": 0, "紫背天葵": 0, "鴨跖草": 0, "鳳尾草": 0, "掛金燈": 0}
清心虛熱 = {"胡黃連": 0, "浮小麥": 0, "蓮子心": 0, "蓮鬚": 0, "西洋參": 0,
        "牡丹皮": 0, "麥冬": 0, "竹瀝": 0, "糯稻根鬚": 0, "白蘞": 0}
清肝虛熱 = {"地骨皮": 0, "牡丹皮": 0, "青蒿": 0, "銀柴胡": 0, "葎草": 0,
        "菊花": 0, "秦艽": 0, "糯稻根鬚": 0, "胡黃連": 0, "竹瀝": 0}
清腎虛熱 = {"牡丹皮": 0, "地骨皮": 0, "青蒿": 0, "西洋參": 0}
清胃虛熱 = {"葛根": 0, "天花粉": 0, "金銀花": 0, "秦艽": 0,
        "白蘞": 0, "人參葉": 0, "雞蛋": 0, "麥冬": 0}
清膽虛熱 = {"青蒿": 0, "秦艽": 0}
清肺虛熱 = {"沙參": 0, "桑葉": 0, "貝母": 0, "天花粉": 0, "地骨皮": 0, "天門冬": 0, "麥冬": 0}
清肝疳熱 = {"銀柴胡": 0, "胡黃連": 0}
清胃疳熱 = {"胡黃連": 0, "銀柴胡": 0}
清大腸熱涼血 = {"馬齒莧": 0, "白頭翁": 0, "十大功勞": 0,
          "鳳尾草": 0, "虎耳草": 0, "地錦草": 0, "委陵菜": 0}
清肝熱明目 = {"羚羊角": 0, "秦皮": 0, "熊膽": 0, "千里光": 0, "夜明砂": 0, "決明子": 0, "車前子": 0, "穀精草": 0,
         "青葙子": 0, "蟬衣": 0, "密蒙花": 0, "刺蒺藜": 0, "草決明": 0, "車前草": 0, "桑葉": 0, "紫貝齒": 0, "珍珠母": 0}
袪心寒 = {"肉桂": 0}
袪肝寒 = {"艾葉": 0, "肉桂": 0, "吳茱萸": 0, "八角": 0, "荔枝核": 0}
袪脾寒 = {"艾葉": 0, "肉桂": 0, "母丁香": 0, "八角": 0, "紅豆蔻": 0, "白豆蔻殼": 0, "砂仁殼": 0}
袪腎寒 = {"八角": 0, "艾葉": 0, "母丁香": 0, "蛇床子": 0, "九香蟲": 0}
袪胃寒 = {"肉桂": 0, "母丁香": 0, "紅豆蔻": 0, "荔枝核": 0}
祛寒濕 = {"胡蘆巴": 0, "仙茅": 0}
祛風熱 = {"金銀花": 0, "薄荷": 0, "菊花": 0, "牛蒡子": 0}
袪咽喉痛 = {"山豆根": 0, "薄荷": 0, "牛蒡子": 0, "桔梗": 0}
袪頭痛 = {"蔓荊子": 0, "薄荷": 0, "荊芥": 0}
袪暑 = {"荷葉": 0, "西瓜翠衣": 0, "滑石": 0, "扁豆花": 0, "青蒿": 0, "佩蘭": 0, "藿香": 0}
祛瘀 = {"番紅花": 0, "血竭": 0, "蘇木": 0, "紅花": 0, "降真香": 0,
      "三稜": 0, "澤蘭": 0, "茜草": 0, "桃仁": 0, "金蕎麥": 0, "瓦楞子": 0, "丹參": 0}
袪風 = {"天麻": 0, "大風子": 0, "蛇床子": 0, "殭蠶": 0,
      "守宮": 0, "露蜂房": 0, "松香": 0, "白鮮皮": 0, "絲瓜絡": 0}
袪肺寒 = {"白芥子": 0}
袪目痛 = {"蔓荊子": 0, "清茶": 0, "荊芥": 0, "薄荷": 0}
去腐生肌 = {"沒藥": 0, "升藥": 0, "乳香": 0, "砒石": 0}
行肝氣 = {"川芎": 0, "青皮": 0, "香附": 0, "八角": 0, "玄胡": 0, "柴胡": 0, "九香蟲": 0, "三稜": 0, "青木香": 0, "綠萼梅": 0, "玫瑰花": 0, "刺蒺藜": 0, "荔枝核": 0,
       "莪术": 0, "合歡皮": 0, "橘絡": 0, "鬱金": 0, "佛手花": 0, "合歡花": 0, "佛手": 0, "八月札": 0, "薄荷": 0, "娑羅子": 0, "苦楝子": 0, "橘葉": 0, "乳香": 0, "川楝子": 0}
行肺氣 = {"薤白": 0, "化橘紅": 0, "蘇梗": 0, "白芥子": 0, "玄胡": 0, "厚朴": 0}
行心包氣 = {"玄胡": 0}
行大腸氣 = {"檳榔": 0, "肉豆蔻": 0}
行胃氣 = {"檳榔": 0, "紅豆蔻": 0, "肉豆蔻": 0, "白豆蔻殼": 0, "青木香": 0, "建神麯": 0, "化橘紅": 0, "砂仁殼": 0,
       "白豆蔻": 0, "薤白": 0, "佛手": 0, "萊菔子": 0, "厚朴花": 0, "佛手花": 0, "甘松": 0, "荔枝核": 0, "娑羅子": 0}
行心氣 = {"鬱金": 0, "乳香": 0}
消浮腫 = {"黃耆": 0}
瀉肝火 = {"黃芩": 0, "龍膽草": 0, "青黛": 0, "槐角": 0,
       "夏枯草": 0, "梔子": 0, "青葙子": 0, "三顆針": 0}
瀉脾火 = {"大黃": 0}
瀉腎火 = {"黃柏": 0, "知母": 0, "澤瀉": 0, "寒水石": 0}
瀉三焦火 = {"梔子": 0}
瀉膀胱火 = {"黃柏": 0}
瀉大腸火 = {"大黃": 0, "黃連": 0, "黃芩": 0, "黃柏": 0, "馬尾連": 0, "三顆針": 0}
瀉胃的積滯 = {"大黃": 0, "薤白": 0, "荔枝核": 0}
瀉脾的積滯 = {"大黃": 0, "狼毒": 0}
瀉大腸的積滯 = {"番瀉葉": 0, "大黃": 0, "續隨子": 0, "薤白": 0}
瀉膽火 = {"龍膽草": 0}

消食積 = {"枳殼": 0, "建神麯": 0, "枳實": 0, "牽牛子": 0, "穀芽": 0, "青皮": 0, "硇砂": 0, "麥芽": 0, "白豆蔻殼": 0, "荸薺": 0, "化橘紅": 0, "萊菔子": 0,
       "厚朴": 0, "胡荽": 0, "使君子": 0, "檳榔": 0, "蟾酥": 0, "百草霜": 0, "劉寄奴": 0, "莪术": 0, "蕪荑": 0, "夜明砂": 0, "水紅花子": 0, "山楂": 0}
消水腫 = {"防己": 0, "生薑皮": 0, "蚤休": 0, "茯苓皮": 0, "浮萍": 0, "雪膽": 0, "麻黃": 0, "澤蘭": 0, "海金沙": 0, "澤漆": 0, "大腹皮": 0, "硼砂": 0, "冬瓜皮": 0, "火硝": 0, "桑白皮": 0, "香薷": 0, "大蒜": 0, "地耳草": 0,
       "馬錢子": 0, "半邊蓮": 0, "黃耆": 0, "梔子": 0, "葫蘆": 0, "木芙蓉葉": 0, "五加皮": 0, "半枝蓮": 0, "蟾酥": 0, "木鼈子": 0, "蟾皮": 0, "落得打": 0, "馬鞭草": 0, "月季花": 0, "龍葵": 0, "青木香": 0, "郁李仁": 0}
消散癰腫 = {"穿山甲": 0, "白芷": 0, "山慈姑": 0, "白芥子": 0, "天南星": 0, "皂刺": 0, "蠍": 0, "連翹": 0, "金銀花": 0, "皂莢": 0, "菊葉三七": 0, "漏蘆": 0, "遠志": 0, "天花粉": 0, "敗醬草": 0, "山豆根": 0, "冬瓜子": 0,
        "蒼耳子": 0, "澤漆": 0, "貝母": 0, "魚腥草": 0, "乳香": 0, "天葵子": 0, "白蘞": 0, "沒藥": 0, "白附子": 0, "八月札": 0, "合歡皮": 0, "白及": 0, "薤白": 0, "西瓜霜": 0, "殭蠶": 0, "橘葉": 0, "金果欖": 0}
消食積和胃 = {"神麴": 0}
消心下痞 = {"枳殼": 0, "枳實": 0, "瓜蔞仁": 0, "半夏": 0}
消癥 = {"穿山甲": 0, "續隨子": 0, "水紅花子": 0}
消斑 = {"青黛": 0, "大青葉": 0}
消痞散結 = {"半夏": 0}
行脾氣 = {"肉豆蔻": 0, "砂仁殼": 0, "白豆蔻殼": 0, "木香": 0, "紅豆蔻": 0, "厚朴": 0, "佛手": 0, "綠萼梅": 0, "蘇梗": 0, "白豆蔻": 0, "紫蘇": 0, "化橘紅": 0, "陳皮": 0, "八角": 0,
       "砂仁": 0, "橘紅": 0, "佛手花": 0, "厚朴花": 0, "橘絡": 0, "降真香": 0, "玫瑰花": 0, "建神麯": 0, "三稜": 0, "九香蟲": 0, "娑羅子": 0, "葛花": 0, "乳香": 0, "甘松": 0}
宣肺氣 = {"桔梗": 0, "麻黃": 0, "胖大海": 0}
宣肺熱 = {"薄荷": 0, "木賊": 0}
洩肺氣 = {"牽牛子": 0}
息肝風 = {"天麻": 0, "蠍": 0, "膽南星": 0, "殭蠶": 0, "穀精草": 0,
       "天南星": 0, "白附子": 0, "腫節風": 0, "六月雪": 0, "白英": 0, "鈎藤": 0}
止咳 = {"天門冬": 0, "百合": 0, "貝母": 0, "罌粟殼": 0, "冬蟲夏草": 0, "紫苑": 0, "金沸草": 0, "飴糖": 0, "款冬花": 0, "蜂蜜": 0, "百部": 0, "蘇子": 0, "訶子": 0, "甘蔗": 0, "天花粉": 0, "蔊菜": 0, "杏仁": 0, "穿山龍": 0,
      "烏梅": 0, "靈芝": 0, "枇杷葉": 0, "羅漢果": 0, "白前": 0, "澤漆": 0, "白毛夏枯草": 0, "松果": 0, "車前草": 0, "桑葉": 0, "虎杖": 0, "榧子": 0, "鳳凰衣": 0, "蛇含": 0, "紫背天葵": 0, "蛇莓": 0, "生薑": 0, "甘草": 0, "紫菀": 0}
止瀉 = {"金櫻子": 0, "芡實": 0, "百草霜": 0, "竈心土": 0, "鐵莧菜": 0, "花椒": 0, "兒茶": 0, "白礬": 0, "老鸛草": 0, "葛根": 0,
      "肉豆蔻": 0, "烏梅": 0, "檵木": 0, "防風": 0, "菟絲子": 0, "梗米": 0, "車前子": 0, "蓮子": 0, "砂仁": 0, "補骨脂": 0}
止嘔 = {"柿蒂": 0, "竈心土": 0, "吳茱萸": 0, "旋覆花": 0, "半夏": 0, "紫蘇": 0, "刀豆": 0,
      "白豆蔻": 0, "蘆根": 0, "枇杷葉": 0, "降真香": 0, "藿香": 0, "生薑": 0, "陳皮": 0}
止痛 = {"花椒": 0, "蟾酥": 0, "丁香": 0, "八角": 0, "胡椒": 0, "川烏": 0, "蘇合香": 0, "青木香": 0, "罌粟殼": 0, "川芎": 0, "毛茛": 0, "血竭": 0, "馬錢子": 0, "降真香": 0, "甘松": 0, "蓽澄茄": 0, "蓽茇": 0, "骨碎補": 0, "木芙蓉葉": 0, "蘇木": 0, "雷公藤": 0, "虎杖": 0, "石見穿": 0, "三稜": 0, "紅藤": 0, "三七": 0, "羌活": 0, "苦楝子": 0, "荔枝核": 0, "水紅花子": 0, "松香": 0, "樟腦": 0, "敗醬草": 0, "白芷": 0, "藁本": 0,
      "天南星": 0, "附子": 0, "蒼耳子": 0, "雪膽": 0, "乳香": 0, "梔子": 0, "腫節風": 0, "細辛": 0, "蚤休": 0, "肉桂": 0, "紅豆蔻": 0, "沒藥": 0, "尋骨風": 0, "瓦楞子": 0, "落得打": 0, "露蜂房": 0, "鬱金": 0, "夏天無": 0, "徐長卿": 0, "劉寄奴": 0, "自然銅": 0, "守宮": 0, "防風": 0, "蠍": 0, "吳茱萸": 0, "蟲白臘": 0, "白附子": 0, "殭蠶": 0, "海蛤殼": 0, "松節": 0, "莪术": 0, "烏賊骨": 0, "飴糖": 0, "蜂蜜": 0, "當歸": 0, "白芍": 0, "草烏": 0, "桂心": 0}
止血 = {"血竭": 0, "象皮": 0, "石灰": 0, "大黃": 0, "兒茶": 0, "赤石脂": 0, "荊芥": 0, "白礬": 0, "降真香": 0, "龜板膠": 0, "鹿銜草": 0, "蓮鬚": 0, "馬勃": 0, "貫眾": 0, "木槿皮": 0, "椿皮": 0, "黃芩": 0, "犀角": 0, "三七": 0, "艾葉": 0,
      "昆明山海棠": 0, "墓頭回": 0, "蓮房": 0, "阿膠": 0, "白毛夏枯草": 0, "蓮子心": 0, "苦參": 0, "續斷": 0, "四季青": 0, "旱蓬草": 0, "委陵菜": 0, "翻白草": 0, "五倍子": 0, "乾薑": 0, "馬齒莧": 0, "荷葉": 0, "萬年青": 0, "地錦草": 0, "桑葉": 0, "蛇莓": 0}
止汗 = {"浮小麥": 0, "黃耆": 0, "五倍子": 0, "五味子": 0,
      "麻黃根": 0, "糯稻根鬚": 0, "白朮": 0, "臍帶": 0, "穭豆衣": 0}
止腹痛 = {"木香": 0}
止經血 = {"龜版": 0}
止癢 = {"地膚子": 0, "蛇蛻": 0, "硫磺": 0, "刺蒺藜": 0, "浮萍": 0, "萹蓄": 0, "松葉": 0,
      "麻黃": 0, "白礬": 0, "蟬衣": 0, "徐長卿": 0, "木槿皮": 0, "土槿皮": 0, "爐甘石": 0}
止痙 = {"天麻": 0, "天南星": 0, "蠍": 0, "殭蠶": 0,
      "牛黃": 0, "防風": 0, "熊膽": 0, "白附子": 0, "蟬衣": 0}
止帶 = {"烏賊骨": 0, "扁豆花": 0, "白芷": 0, "芡實": 0, "秦皮": 0, "墓頭回": 0, "白果": 0}
止經痛 = {"香附": 0}
止疳痢 = {"雞蛋": 0}
逐水 = {"狼毒": 0, "續隨子": 0}
除煩 = {"小麥": 0, "蓮子心": 0, "石膏": 0, "梔子": 0, "淡竹葉": 0,
      "蘆根": 0, "麥冬": 0, "淡豆豉": 0, "梗米": 0, "木通": 0}
除骨蒸 = {"青蒿": 0}
升肝陽 = {"荷葉": 0, "柴胡": 0}
升脾陽 = {"黃耆": 0, "葛根": 0, "升麻": 0}
升腎陽 = {"澤瀉": 0}
升胃陽 = {"升麻": 0}
生肌止痛 = {"白蘞": 0}
收斂生肌 = {"血竭": 0, "珍珠": 0, "松香": 0, "石膏": 0,
        "象皮": 0, "兒茶": 0, "鉛丹": 0, "蟲白臘": 0, "滑石": 0}
收斂固澀 = {"芡實": 0, "山茱萸": 0, "五味子": 0, "牡蠣": 0}
殺蟲 = {"砒石": 0, "硫磺": 0, "苦參": 0, "百部": 0, "苦楝皮": 0, "雷丸": 0, "雷公藤": 0, "花椒": 0, "輕粉": 0, "使君子": 0, "蕪荑": 0, "密陀僧": 0, "續隨子": 0, "苦楝子": 0, "鶴虱": 0, "榧子": 0, "貫眾": 0, "石灰": 0, "大風子": 0,
      "皂礬": 0, "石榴皮": 0, "羊蹄根": 0, "鶴草芽": 0, "白礬": 0, "露蜂房": 0, "牽牛子": 0, "松香": 0, "椿皮": 0, "蛇床子": 0, "樟腦": 0, "毛茛": 0, "大蒜": 0, "狼毒": 0, "仙鶴草": 0, "薏苡根": 0, "木槿皮": 0, "松葉": 0, "土槿皮": 0, "南瓜子": 0}
潤大腸燥 = {"郁李仁": 0}
潤腸燥 = {"麻子仁": 0, "大麻仁": 0, "瓜蔞仁": 0, "硫磺": 0, "桃仁": 0, "蘇子": 0, "桑椹": 0, "胡桃仁": 0, "決明子": 0, "冬葵子": 0, "松果": 0, "柏子仁": 0, "杏仁": 0,
       "豬膽汁": 0, "輕粉": 0, "草決明": 0, "肉蓯蓉": 0, "牽牛子": 0, "芒硝": 0, "羊蹄根": 0, "槐角": 0, "胖大海": 0, "羅漢果": 0, "鎖陽": 0, "蜂蜜": 0, "生首烏": 0, "當歸": 0, "玄參": 0, "麥冬": 0}

軟堅散結 = {"斑蝥": 0, "鱉甲": 0, "蟾酥": 0, "牡蠣": 0, "木鼈子": 0, "火硝": 0, "硇砂": 0,
        "黃藥子": 0, "馬錢子": 0, "狼毒": 0, "海粉": 0, "浮海石": 0, "海蛤殼": 0, "瓦楞子": 0, "守宮": 0}
燥脾濕 = {"白朮": 0, "蒼朮": 0, "白豆蔻": 0, "草果": 0, "天南星": 0, "荷葉": 0, "扁豆衣": 0, "松節": 0, "砂仁殼": 0, "白豆蔻殼": 0, "芡實": 0, "秦艽": 0, "白鮮皮": 0, "松葉": 0, "白礬": 0,
       "扁豆花": 0, "陳皮": 0, "大風子": 0, "建神麯": 0, "半夏": 0, "土槿皮": 0, "松香": 0, "石灰": 0, "樟腦": 0, "橘紅": 0, "石菖蒲": 0, "化橘紅": 0, "木瓜": 0, "佩蘭": 0, "藿香": 0, "砂仁": 0, "六君子湯": 0}

燥肝濕 = {"龍膽草": 0, "白附子": 0, "葛根": 0, "秦皮": 0, "大風子": 0, "松香": 0, "伸筋草": 0, "烏賊骨": 0, "千年健": 0, "秦艽": 0, "十大功勞": 0, "椿皮": 0,
       "石灰": 0, "雄黃": 0, "土茯苓": 0, "夏天無": 0, "青風藤": 0, "白礬": 0, "穿山龍": 0, "昆明山海棠": 0, "爐甘石": 0, "鉛丹": 0, "六月雪": 0, "三顆針": 0}
燥肺濕 = {"香薷": 0, "松果": 0, "兒茶": 0, "白礬": 0, "蒼耳子": 0, "松香": 0, "厚朴": 0,
       "黃芩": 0, "馬尾連": 0, "穿心蓮": 0, "穿山龍": 0, "化橘紅": 0, "六月雪": 0}
燥腎濕 = {"雄黃": 0, "蛇床子": 0, "大風子": 0, "烏賊骨": 0, "黃柏": 0, "附子": 0, "砂仁殼": 0}
燥膽濕 = {"黃芩": 0, "秦艽": 0}
燥膀胱濕 = {"黃柏": 0, "羌活": 0, "龍膽草": 0}
燥三焦濕 = {"黃芩": 0}
散心下結 = {"半夏": 0}
散瘀 = {"玄胡": 0, "花蕊石": 0, "三七": 0, "自然銅": 0, "赤芍": 0, "牡丹皮": 0, "琥珀": 0, "景天三七": 0, "川牛膝": 0, "劉寄奴": 0,
      "蓮房": 0, "土牛膝": 0, "血餘炭": 0, "鬼針草": 0, "菊葉三七": 0, "雞骨草": 0, "敗醬草": 0, "馬鞭草": 0, "夜明砂": 0, "木通": 0, "山楂": 0, "酒": 0}
散脾瘀 = {"大黃": 0}
散胃瘀 = {"大黃": 0}
散大腸瘀 = {"大黃": 0}
縮尿 = {"益智仁": 0, "覆盆子": 0, "桑螵蛸": 0, "刺蝟皮": 0, "白果": 0, "補骨脂": 0, "糯米": 0}

益精 = {"麋茸": 0, "胡桃仁": 0, "肉蓯蓉": 0, "巴戟天": 0}
益精血 = {"製首烏": 0}
抑肝陽 = {"白芍": 0, "天麻": 0, "龍骨": 0, "生赭石": 0}
溫經通陽 = {"薤白": 0, "蔥": 0, "桂枝": 0}
溫經通脈 = {"肉桂": 0, "毛冬青": 0, "桂心": 0}
烏鬚 = {"女貞子": 0, "製首烏": 0}
安胎 = {"艾葉": 0, "黃芩": 0, "苧麻根": 0, "菟絲子": 0, "砂仁殼": 0,
      "白朮": 0, "桑寄生": 0, "砂仁": 0, "續斷": 0, "杜仲": 0}
生津 = {"北沙參": 0, "麥冬": 0, "蘆根": 0, "石膏": 0, "葛根": 0, "沙參": 0, "梨皮": 0, "人參": 0, "五味子": 0, "萎蕤": 0}

功效集合 = [補元氣,
        補脾氣,
        補肺氣,
        補心氣,
        補中氣,
        補衛氣,
        補胃氣,
        補腎氣,
        補脾陰,
        補脾血,
        補脾陽,
        補腎精,
        補肺陰,
        補腎陰,
        補心陰,
        補肝陰,
        補胃陰,
        補腎陽,
        補肺陽,
        補肝陽,
        補心血,
        補肝血,
        補肺血,
        補腎血,
        補心陰涼血,
        補肝陰涼血,
        補腎陰涼血,
        補胃陰涼血,
        補三焦陰涼血,
        補經絡陽,
        平肝陽,
        平肝熱,
        平喘,
        排膿,
        排肺膿,
        排皮膚膿,
        明目,
        發散表寒,
        發散表熱,
        發散裡寒,
        發散表風,
        發汗解表,
        透疹,
        透發麻疹,
        通乳,
        通腎竅,
        通鼻竅,
        通膀胱竅,
        通利咽喉,
        通經絡,
        托瘡生肌,
        托瘡毒,
        調和藥性,
        調衝任,
        拖瘡生肌,
        納腎氣,
        利脾濕,
        利肝濕,
        利肺濕,
        利腎濕,
        利三焦濕,
        利膀胱濕,
        利皮毛濕,
        利胃濕,
        利大腸濕,
        利心濕,
        利小腸濕,
        利尿通淋,
        療傷續折,
        療瘡,
        斂肺氣,
        斂腎精,
        固表止汗,
        固精,
        開提肺氣,
        開心竅,
        寬中,
        活血,
        活心血,
        活肝血,
        活脾血,
        活肺血,
        活腎血,
        活胃血,
        活大腸血,
        活心包血,
        活血通淋,
        化痰,
        回陽,
        緩急,
        解表發汗,
        降肺氣,
        降胃氣,
        解毒,
        解心毒,
        解肝毒,
        解肺毒,
        解胃毒,
        解大腸毒,
        解膽毒,
        解蛇毒,
        截瘧,
        清熱解毒,
        祛風寒,
        袪膀胱經風寒,
        清三焦熱涼血,
        祛風濕,
        清心熱涼血,
        清肝熱涼血,
        清肺熱涼血,
        清腎熱涼血,
        清胃熱涼血,
        清膽熱涼血,
        清心熱,
        清肝熱,
        清脾熱,
        清肺熱,
        清腎熱,
        清膽熱,
        清大腸熱,
        清膀胱熱,
        清心虛熱,
        清肝虛熱,
        清腎虛熱,
        清胃虛熱,
        清膽虛熱,
        清肺虛熱,
        清肝疳熱,
        清胃疳熱,
        清大腸熱涼血,
        清肝熱明目,
        袪心寒,
        袪肝寒,
        袪脾寒,
        袪腎寒,
        袪胃寒,
        祛寒濕,
        祛風熱,
        袪咽喉痛,
        袪頭痛,
        袪暑,
        祛瘀,
        袪風,
        袪肺寒,
        袪目痛,
        去腐生肌,
        行肝氣,
        行肺氣,
        行心包氣,
        行大腸氣,
        行胃氣,
        行心氣,
        消浮腫,
        瀉肝火,
        瀉脾火,
        瀉腎火,
        瀉三焦火,
        瀉膀胱火,
        瀉大腸火,
        瀉胃的積滯,
        瀉脾的積滯,
        瀉大腸的積滯,
        瀉膽火,
        消食積,
        消水腫,
        消散癰腫,
        消食積和胃,
        消心下痞,
        消癥,
        消斑,
        消痞散結,
        行脾氣,
        宣肺氣,
        宣肺熱,
        洩肺氣,
        息肝風,
        止咳,
        止瀉,
        止嘔,
        止痛,
        止血,
        止汗,
        止腹痛,
        止經血,
        止癢,
        止痙,
        止帶,
        止經痛,
        止疳痢,
        逐水,
        除煩,
        除骨蒸,
        升肝陽,
        升脾陽,
        升腎陽,
        升胃陽,
        生肌止痛,
        收斂生肌,
        收斂固澀,
        殺蟲,
        潤大腸燥,
        潤腸燥,
        軟堅散結,
        燥脾濕,
        燥肝濕,
        燥肺濕,
        燥腎濕,
        燥膽濕,
        燥膀胱濕,
        燥三焦濕,
        散心下結,
        散瘀,
        散脾瘀,
        散胃瘀,
        散大腸瘀,
        縮尿,
        益精,
        益精血,
        抑肝陽,
        溫經通陽,
        溫經通脈,
        烏鬚,
        安胎,
        生津]