import openpyxl
import time

藥材功效 = [
    ["麻黃", "透疹", "發散表寒", "通鼻竅", "利三焦濕", "利皮毛濕", "利肺濕", "消水腫", "平喘", "止癢", "宣肺氣"],
    ["桂枝", "補心陽", "發散表寒", "祛風寒", "溫經通陽", "補經絡陽", "解表發汗"],
    ["杏仁", "降肺氣", "止咳", "潤腸燥", "平喘"],
    ["炙甘草", "補心氣", "補脾氣", "降胃氣"],
    ["白芍", "緩急", "補肝血", "斂肝陰", "抑肝陽", "平肝陽", "止痛"],
    ["生薑", "祛風寒", "補肺陽", "補心陽", "發散表寒", "解胃毒"],
    ["大棗", "補胃氣", "調和藥性", "補脾血", "養心安神", "補脾氣"],
    ["羌活", "袪膀胱經風寒", "燥膀胱濕", "止痛"],
    ["防風", "祛風寒", "發散表寒", "止痙", "止痛", "止瀉"],
    ["蒼朮", "祛風濕", "燥脾濕", "補脾氣"],
    ["細辛", "發散裡寒", "通膀胱竅", "通腎竅", "化痰", "補肺陽"],
    ["川芎", "行肝氣", "發散表寒", "止痛", "活血", "祛風寒"],
    ["白芷", "消散癰腫", "發散表風", "止帶", "通鼻竅", "燥胃濕", "止痛"],
    ["黃芩", "解肝毒", "瀉肝火", "清三焦熱涼血", "清肝熱涼血", "瀉心火", "燥胃濕", "清膽熱", "清膽熱涼血", "清三焦熱", "燥三焦濕", "燥肺濕",
        "清心熱涼血", "止血", "清肺熱涼血", "清胃熱涼血", "清胃熱", "燥膽濕", "瀉大腸火", "燥大腸濕", "清肺熱", "瀉胃火", "清大腸熱", "安胎", "清腎熱"],
    ["生地黃", "清肝熱", "補肝陰涼血", "補腎陰", "補心陰涼血", "補腎陰涼血",
        "補肝陰", "補肺陰", "生津", "清腎熱", "補肺陰涼血", "清心熱"],
    ["甘草", "調和藥性", "清熱解毒", "化痰", "解胃毒", "清胃熱", "補脾氣", "止咳", "補肺陰"],
    ["獨活", "發散表寒", "止痹痛", "祛風濕"],
    ["藁本", "祛風濕", "發散表寒", "止痹痛", "止痛"],
    ["蔓荊子", "祛頭痛", "發散表風", "祛目痛", "發散表熱"],
    ["紫蘇", "發散表寒", "止嘔", "行脾氣"],
    ["香附", "行肝氣", "止經痛", "調月經"],
    ["陳皮", "行脾氣", "燥脾濕", "降胃氣", "化痰", "止嘔"],
    ["乾薑", "補脾陽", "補經絡陽", "溫月經", "回陽", "補肺陽", "止血", "化痰"],
    ["半夏", "降胃氣", "止嘔", "消心下痞", "散心下結", "化痰", "消痞散結", "燥脾濕"],
    ["五味子", "止血", "補胃氣", "歛肺氣", "生津", "收斂固澀", "止汗", "補腎陰", "開心竅"],
    ["紫菀", "化痰", "止咳"],
    ["百部", "殺蟲", "止咳", "潤肺燥"],
    ["白前", "降肺氣", "化痰", "止咳"],
    ["桔梗", "宣肺氣", "開提肺氣", "清熱解毒", "排皮膚膿", "祛咽喉痛",
        "排肺膿", "通利咽喉", "排膿", "手太陰肺經", "化痰"],
    ["橘紅", "化痰", "行脾氣", "燥脾濕"],
    ["荊芥", "發散表風", "消瘡", "止血", "透疹"],
    ["金銀花", "清肺熱", "消散癰腫", "解心毒", "清胃熱", "清胃虛熱", "祛風熱", "解肺毒", "清心熱"],
    ["連翹", "發散表熱", "清心熱", "清肺熱", "消散癰腫", "解心毒"],
    ["牛蒡子", "降肺氣", "化痰", "止咳"],
    ["薄荷", "祛頭痛", "宣肺熱", "祛咽喉痛", "透疹", "祛風熱", "行肝氣"],
    ["淡豆豉", "除煩", "發散表熱"],
    ["淡竹葉", "利尿通淋", "清心熱", "除煩", "利心濕", "利小腸濕"],
    ["蘆根", "生津", "清肺熱", "除煩", "止嘔", "清胃熱"],
    ["菊花", "平肝熱", "解肝毒", "明目", "清肝虛熱", "祛風熱"],
    ["石膏", "清胃熱", "收斂生肌", "生津", "瀉胃火", "除煩", "清肺熱"],
    ["葛根", "清胃虛熱", "燥肝濕", "生津", "升脾陽", "透疹", "止瀉", "透發麻疹"],
    ["柴胡", "行肝氣", "清膽熱", "升肝陽", "清肝熱", "足厥陰肝經", "手厥陰心包絡經", "手少陽三焦經", "足少陽膽經"],
    ["升麻", "透疹", "解胃毒", "升胃陽", "升脾陽", "清胃熱", "發散表熱", "足太陰脾經", "手太陰肺經"],
    ["枳殼", "清胃熱", "清大腸熱", "消食積", "消心下痞", "化痰"],
    ["前胡", "降肺氣", "清肺熱", "化痰"],
    ["茯苓", "利脾濕", "補脾氣", "養心安神"],
    ["人參", "補脾氣", "補元氣", "養心安神", "補肺氣", "補心氣", "生津"],
    ["木香", "行脾氣", "止腹痛"],
    ["附子", "回陽", "止痛", "祛風寒", "燥腎濕", "發散裡寒", "補腎陽"],
    ["萎蕤", "補脾陰", "補胃陰", "生津"],
    ["蔥", "發散表寒", "溫經通陽", "安回", "解肺毒"],
    ["白薇", "清胃熱涼血", "清肝熱涼血", "利尿通淋", "補肝陰涼血", "消瘡", "清肝熱", "解肝毒", "補胃陰涼血"]
]


# open excel
data = openpyxl.load_workbook("原始藥效.xlsx")
sheet = data.worksheets[0]


def compareeffect(row, index):
    # output is stored at col 5
    std_col = 5
    # original effect's char
    for char_ori in sheet.cell(row, 4).value:
        # std effect
        for str_std in 藥材功效[index]:
            for char_std in str_std:
                # if there is a char is the same between original effect & std effect
                if char_ori == char_std:
                    # if the std effect is repeat at the front cell, continue
                    if(std_col > 5 and str_std == sheet.cell(row, std_col-1).value):
                        continue
                    # else, std effect is stored at col (>=5)
                    sheet.cell(row, std_col).value = str_std
                    std_col += 1


# loop the whole file
for row in range(2, sheet.max_row, 1):
    # medicine's name
    checkName = sheet.cell(row, 3).value
    for check in range(len(藥材功效)-1):
        # 藥材功效[i][0] is the medicine name
        if checkName == 藥材功效[check][0]:
            compareeffect(row, check)


data.save('原始藥效.xlsx')

